<template>
  <div class="form-root">
    <div class="form-paper">
      <div class="paper-title">
        <h4>پذیــرش متقــاضی</h4>
      </div>
      <section>
        <label class="labels" for="docadate"
          ><span>تاریخ تنظیم:</span> {{ form.content.docdate }}</label
        >
        <label class="labels" for="docadate"
          ><span>تاریخ تولد:</span> {{ form.content.birthdate }}</label
        >
        <p class="paragraph" id="paper">
          اساس مندرجات این فرم در تاریخ
          <span>{{ form.content.docdate }}</span>
          پس از انجام تحقیق و بررسی های لازم در مورد وضعیت فردی و معیشتی خانم
          <span>{{ form.content.cfname }} {{ form.content.clname }}</span>
          فرزند
          <span>{{ form.content.father }}</span>
          به شماره شناسنامه
          <span>{{ form.content.idnumber }}</span>
          و شماره ملی
          <span>{{ form.nationalno }}</span>
          صادره از
          <span>{{ form.content.eligedby }}</span>
          با
          <span>{{ form.content.numberofsupervisions }}</span>
          نفر عائله تحت تکفل، مطابق فرم های اطلاعات به شماره 1 و بازدید از منزل
          به شماره 3 و معرفی به شماره 4 و مدارک پیوست واجد شرایط پذیــرش در
          موسسه خیریه روزبه تشخیص داده شد. لذا توافقات جهت آموزش، ارتقا سطح
          مهارت و کمک به امور معیشتی ایشان به شرح ذیل انجام خواهد شد.
        </p>
        <p class="paragraph">
          1 - با توجه به اینکه اداره امور خیریه فی سبیل الله و تبرعی بوده و اعضا
          هیئت مدیره و مدیرعامل، مربیان، مددکاران اجتماعی و سایر دست اندر کاران
          خیریه منتفع نمی باشند صرفا به منظور کمک و حمایت از متقاضی برای بهبود
          وضع معیشتی و مهارت های زندگی ایشان دوره های آموزشی برگزار می نماید،
          لذا هیچگونه
          <span>
            رابطه کارگری و کارفرمایی فیمابین متقاضی و موسسه وجود نداشته و روابط
            حاصله خارج از شمول مقررات قانون کار و تامین اجتماعی می باشد و مددجو
            با اذعان کامل به موضوع حق هرگونه ادعای بعدی در این رابطه را از خود
            سلب می کند.
          </span>
        </p>
        <p class="paragraph">
          2 - موسسه خیریه روزبه بر این اعتقاد است که صرفا پرداخت کمک های مالی به
          متقاضی نیازمند توانمندی های فردی را تقلیل و متقاضی را از حرکت به سوی
          زندگی مستقل باز می دارد. به همین منظور در تلاش است با آموختن انواع
          مهارت های درآمدزا در کوتاه مدت و ارجاع متقاضیان به بازار کار، آنان را
          به سوی یک زندگی سالم و مستقل هدایت نماید.
        </p>
        <p class="paragraph">
          3 - پذیــرش متقاضی یا توجه به اطلاعات داده شده از طرف وی انجام می گیرد
          و در صورت اثبات هرگونه ادعای کذب در ارتباط با تعداد عائله، وضعیت معاش،
          محل سکونت و ...، موسسه بلافاصله اقدام به قطع همکاری با وی خواهد نمود.
        </p>
        <p class="paragraph">
          4 - متقاضی متعهد می باشد که مطابق برنامه زمان بندی شده از سوی موسسه با
          حضور در محل مشخص شده نسبت به فراگیری آموزش ها و کسب مهارت های زندگی
          اقدام و پس از اتمام دوره های آموزش موسسه را ترک نماید.
        </p>
        <p class="paragraph">
          5 - همزمان با تکمیل این تعهدنامه، برای آشنایی کامل متقاضی در ابتدای
          ورود با دوره های آموزشی و جزئیات آنها، فرم آشنایی با دوره های آموزشی
          موسسه خیریه روزبه به شماره FQ12-06/00 در اختیار متقاضی قرار گرفته و
          ایشان ضمن مطالعه دقیق، آن را امضاء می نماید. در این صورت به طور کامل
          از سرفصل های دوره های آموزشی مطلع شده و آزادانه می تواند یکی از دوره
          ها را برای مهارت آموزی انتخاب نماید.
        </p>
        <p class="paragraph">
          6 - حضور متقاضی در دوره های آموزشی الزامی می باشد و چنانچه در فراگیری
          آموزش ها اهتمام نورزد، موسسه می تواند فرد متقاضی دیگری را جایگزین
          نماید.
        </p>
        <p class="paragraph">
          7 - حضور منظم متقاضی در کلاس های تعیین شده الزامی است و غیبت از کلاس
          ها در موارد اضطراری با هماهنگی قبلی با مسئولین موسسه ممکن خواهد بود.
        </p>
        <p class="paragraph">
          8 - مسئولین موسسه هیچگونه وجهی از بابت خدمات و آموزش، سواد، مشاوره
          روانی، حقوقی و ... از متقاضی دریافت نمی نمایند.
        </p>
        <p class="paragraph">
          9 - متقاضی متعهد می شود در طی دوره آموزشی از امکاناتی که در اختیار وی
          قرار می گیرد به نحو احسن استفاده نموده و از وارد آوردن هرگونه خسارتی
          به امکانات یاد شده جلوگیری نماید.
        </p>
        <p class="paragraph">
          10 - متقاضی بدون اخذ مجوز و بدون هماهنگی با مسئولین موسسه، حق خارج
          نمودن هیچگونه مواد اولیه یا محصول، وسیله یا ابزاری را از موسسه ندارد.
        </p>
        <p class="paragraph">
          11 - متقاضی متعد می شود ضوابط و مقررات موسسه را به نحو احسن رعایت
          نموده و از انجام هرگونه عمل مغایر با شئونات موسسه خودداری نماید.
        </p>
        <p class="paragraph">
          12 - متقاضی متعهد می گردد مقررات ایمنی را که توسط مربیان موسسه آموزش
          داده می شود با نهایت دقت رعایت نماید در غیر این صورت مسئولیت هرگونه
          حادثه ناشی از عدم رعایت ضوابط ایمنی به عهده مشخص مددجو خواهد بود.
        </p>
        <p class="paragraph">
          13 - متقاضی در صورت ازدواج دائم یا موقت از چتر حمایتی موسسه خارج می
          گردد.
        </p>
        <p class="paragraph">
          14 - متقاضی متعهد می گردد در صورت تغییر آدرس محل زندگی بلافاصله موارد
          را به موسسه اطلاع دهد.
        </p>
        <p class="paragraph">15 - داشتن آرایش و پوشش نامناسب ممنوع می باشد.</p>
        <p class="paragraph">
          16 - استفاده از گوشی همراه از ساعت شروع تا پایان آموزش ممنوع می باشد.
        </p>
        <p class="paragraph">
          17 - اینجانب متعهد می شوم که با همیاران و عوامل خیر موسسه روزبه رقتار
          مناسبی داشته باشم.
        </p>
      </section>
      <hr />
      <section class="sections">
        <label class="labels" for="docadate"
          ><span>نام و نام خانوادگی مددجو:</span> {{ form.content.cfname }}
          {{ form.content.clname }}</label
        >
      </section>
      <hr />
      <section>
        <button class="close" @click="deleteit(form._id)">حذف</button>
      </section>
    </div>
  </div>
</template>

<script>
import axios from "axios";

export default {
  name: "FQ12-05-00",
  data: () => {
    return {
      form: {},
    };
  },
  methods: {
    async deleteit(id) {
      await axios
        .delete("http://localhost:3000/forms/" + id)
        .then((res) => {
          if (res.status == 200) {
            alert("فرم حذف شد");
          } else {
            alert("خطا در پردازش");
          }
        })
        .catch((err) => {
          console.log(err);
        });
    },
  },
  async mounted() {
    await axios
      .get("http://localhost:3000/forms/single/" + this.$route.params.id)
      .then((res) => {
        if (res.status == 200) {
          this.form = res.data;
        } else {
          alert("خطا در پردازش درخواست");
        }
      })
      .catch((err) => {
        console.log(err);
      });
  },
};
</script>

<style>
.form-root {
  overflow: hidden;
  width: 100%;
  padding: 2%;
  margin: 0;
}

.form-paper {
  width: 100%;
  border: black 1px solid;
  padding: 20px;
  margin: 10px auto;
  text-align: justify;
}

.paper-title {
  text-align: center;
  padding: 40px;
}

.form-fields {
  width: 100%;
  padding: 20px;
}

.labels {
  width: 50%;
}

span {
  font-weight: 600;
}

.paragraph {
  font-family: "Vazir";
}
</style>
